#!/usr/bin/env python
#-*- coding: utf-8 -*-
# author：zhangjiao
print()
'''
1.打印星星号
从控制台输入1
*
输入3
 *
***
 *
输入5
  *
 ***
*****
 ***
  *
依次类推

2.写一个双色球彩票系统，系统可以随机产生一组随机数据，一组彩票数据有六位数，
这六位数的的取值范围是0和1。[001001]一张彩票是两块钱，用户可以充值金额，
并且可以决定自己购买彩票的张数,若余额不足,则提示充值,若用户拒绝充值,则退出游戏
若余额充足,用户输入猜测的数据[要求输入的数据必须合法]，若是猜对，
则打印”恭喜你中大奖了“ 奖励的金额=投入金额*100，若没猜中则打印”继续加油！“。
用户可以选择继续买票或者是退出。买票和退出的时候要求打印剩余金额。

3.实现用户输入用户名和密码，当用户名为 seven且密码为123时，
显示登陆成功，否则登陆失败，失败时允许重复输入三次

4.猜数字
很多人在聚餐时都玩过猜数字游戏，由某人随机出一个指定范围内的数，
然后其他人一个一个猜，猜的过程中区间不断缩小，直到猜中为止。
这里的猜数字游戏就是用程序来代替那个出数字的人，程序算法设计为：
1.输入数字区间--->2.系统产生区间内的随机数--->
3.玩家输入自己猜的数字--->4.比较玩家猜的与答案的高低并提示--->
5.未猜中则回到3，猜中则提示猜次数

5.2019个人所得税计算器
'''

