#!/usr/bin/env python
#-*- coding: utf-8 -*-
# author：zhangjiao
print()
'''
位运算：使用位运算的时候，需要将数值转为二进制
&  按位与    若对应位两个值都为1，则该位结果为1
|  按位或  若对应位两个值有一个为1，则该结果为1
^  按位异或 若对应位两个值相同则为0，相异则为1
~  按位取反 将对应位上的0变1，1变0
<<  左移
>>  右移
'''
#
# print(3&2)
# '''
# 011
# 010
# ----
# 010
# '''
# print(3|2)
# '''
# 011
# 010
# ----
# 011
# '''
# print(3^2)
# '''
# 011
# 010
# ---
# 001
# '''
print(~4)
# '''
# 0000 0011
# 1111 1100   补码
# 1111 1011   反码
# 1000 0100   原码  -4
# # '''
# print(3<<3)
# '''
# 011
# 01100
# '''
# print(3>>2)
# '''
# 011
#   011
# 3//2^2
# '''