# if
# or
# and
# False
# True
# str
# goto保留字，在以后的python版本可能会变成关键字。

# 保留字关键字不能作为变量名。
help("keywords")

# 有一辆车速度为50KM/h,B车是他速度的两倍还要多5KM/h,求B的速度
x = 50*2 +5  # x在数学中称之为未知数，在编程中称之为变量

x = 100*2 +5  # 数学中未知数的值允许发生变化，编程中变量的值也允许发生变化。

# 变量：一个值允许发生变化的量。   关键字不允许当作变量名。

y = 100
y = 200
y = 23
print(y)


#变量的名字，就叫做标识符
a = 10 #a就是标识符
#标识符命名规则：
#1.尽量要做到见名识意。不要a = 10 ，最好是sum = 10， count = 10
#2.只能由字母，数字，下划线所组成，且不能以数字开头，不能有特殊字符。
#3.驼峰原则，单词首字母大写。
#4.严格区分大小写。
student_list = ["zhangsan","lisi"]  #下划线分隔
studentList = ["zhangsan","lisi"]  #首字母大写分隔
print(student_list)

#标识符的作用：命名函数、变量、类。









