

# 网络编程

# socket
#   TCP/UDP
#   TCP: 可靠的，双向通信，服务端可以随时发数据给客户端，客户端也可以随时发给服务端
#       ’三次握手‘ ： 目的确保可靠连接
#           客户端             服务端
#             |->        SYN   ->|
#             |<-  ACK + SYN   <-|
#             |->        ACK   ->|
#
#       ’四次挥手‘
#           客户端             服务端
#              |->        FIN   ->|
#              |<-  ACK         <-|
#              |<-  FIN         <-|
#              |->        ACK   ->|
#
#   UDP: 速度较快
#
#   Http：客户端主动发请求给服务端，简单，不用一直占用服务器资源
#
#  智能硬件：可以用手机控制， 网线，WIFI，蓝牙，红外线, 电磁波。
#     智能音箱：局域网
#
#
#






