# LOL

# 面向过程:  ( 只有变量和函数 )

# 变量: 特征(属性)
# 函数: 行为(方法)

# 英雄: 特征: 血量, 移速, 攻击力, 护甲, 暴击率, 闪避
# 物品: 特征: 加血, 加甲, 加攻, 加魔抗, 加移速

# 英雄: 行为(主动): 攻击, 移动, 放技能.
# 物品: 行为(主动): 加血, 缴械, 加移速

# 使用面向过程做游戏,属性会混在一起,方法也会混在一起.逻辑不清晰


# 面向对象:  ( 一切皆对象 ) 数字,字符串,元组,字典,列表,集合,都是对象

# 英雄对象: 属性: 血量, 移速, 攻击力, 护甲, 暴击率, 闪避
#          方法: 攻击, 移动, 放技能.


# 物品对象: 属性: 加血, 加甲, 加攻, 加魔抗, 加移速
#          方法: 加血, 缴械, 沉默,


# 野怪对象: 属性: 血量, 移速, 攻击力, 护甲
# 		   方法: 攻击, 移动, 技能


# 小兵对象: 属性: 血量, 移速, 攻击力, 护甲

# 使用面向对象, 能够将对象的属性和行为分门别类, 每个对象都会有自己的属性和方法
# 将生活中所见的事物, 放到计算机中实现