# 列表(数组):一个容器,用于放置多个相同的数据变量
# 作用:将多个元素按照顺序存储在一起,方便进行运算
# 链表存储数据内存空间可以不连续,列表存储数据内存空间必须连续
list1 = [1,2,3,4,4]
list2 = ["a","b","v","c","x"]
list3 = []      #空列表
list4 = [1,"adad",True]      #列表其实也能放不同的数据类型


print(list4)


list2 = ["a","b","v","c","x"]
#         0   1   2   3   4  从前往后
#  索引   -5  -4  -3  -2  -1  从后往前
# 使用索引(下标)获取其中一个元素
print(list2[0])      # 获取第0个元素
print(list2[-1])     # 获取最后一个元素

# 如果使用的索引,超出了列表的长度-1,那就会产生越界问题
# print(list2[5])       print(list2[-19])

# 有多个变量需要求和
age1 = 10
age2 = 11
age3 = 22
list3 = [age1,age2,age3]
print(sum(list3))          # sum函数可以放入一个列表.用于对列表所有元素求和

list2[2] = "hello"         # 替换列表元素
print(list2)

# 删除列表元素
del list2[2]
print(list2)

print(list2[2])